{"pageProps":{"id":"assign-teacher-to-tutorial","audience":"staff","markdown":"\nEach tutorial in Doubtfire should have an assigned teaching staff member, to ensure that the submissions for the\ntutorial are directed to the correct teaching staff. To assign a tutor to a tutorial, simply log in to Doubtfire, and\nselect manage units from the Administration dropdown:\n\n![Manage units](/guides/assign-teacher-to-tutorial/manage-units.png)\n\nNext, Select the appropriate unit to administer:\n\n![Select unit](/guides/assign-teacher-to-tutorial/select-unit.png)\n\nFirst, select the _staff_ tab to ensure that the tutor you wish to assign is enrolled in the unit, and has the correct\npermission:\n\n![Staff tab](/guides/assign-teacher-to-tutorial/staff-tab.png)\n\nOnce that is done, select the _tutorials_ tab, and select the tutorial in the list you wish to assign a tutor to, then\nfrom the _Tutor_ dropdown, select the appropriate tutor:\n\n![Edit tutorial](/guides/assign-teacher-to-tutorial/edit-tutorial.png)\n","title":"Assign Teachers to a Tutorial","summary":"See how you can assign staff to a tutorial.","authors":["jakerenzella"],"html":"<p>Each tutorial in Doubtfire should have an assigned teaching staff member, to ensure that the submissions for the tutorial are directed to the correct teaching staff. To assign a tutor to a tutorial, simply log in to Doubtfire, and select manage units from the Administration dropdown:</p><p><img src=\"/guides/assign-teacher-to-tutorial/manage-units.png\" alt=\"Manage units\"></p><p>Next, Select the appropriate unit to administer:</p><p><img src=\"/guides/assign-teacher-to-tutorial/select-unit.png\" alt=\"Select unit\"></p><p>First, select the <em>staff</em> tab to ensure that the tutor you wish to assign is enrolled in the unit, and has the correct permission:</p><p><img src=\"/guides/assign-teacher-to-tutorial/staff-tab.png\" alt=\"Staff tab\"></p><p>Once that is done, select the <em>tutorials</em> tab, and select the tutorial in the list you wish to assign a tutor to, then from the <em>Tutor</em> dropdown, select the appropriate tutor:</p><p><img src=\"/guides/assign-teacher-to-tutorial/edit-tutorial.png\" alt=\"Edit tutorial\"></p>","toc":[]},"__N_SSG":true}