{"pageProps":{"id":"change-target-grade","audience":"student","markdown":"\nIn Doubtfire, your target grade indicates to both you and the teaching staff, how you are looking to approach your unit\nof study.\n\nThere are four target grades:\n\n- **P** - Pass\n- **C** - Credit\n- **D** - Distinction\n- **HD** - High Distinction\n\nThe target grade selected in Doubtfire changes the sequence and number of tasks which need to be completed in order to\nachieve that grade.\n\nFor example, there may be 20 Pass tasks in a unit which need to be completed to achieve a Pass grade, however to achieve\na Credit grade you would need to complete all of the Pass tasks, and the Credit tasks.\n\nTo change your target grade, simply log in to Doubtfire and select the unit for which you'd like to change the target\ngrade.\n\nFrom the main overview page, select the _target grade_ dropdown:\n\n![Profile view](/guides/change-target-grade/profile-view.png)\n\nThen select the target grade:\n\n![Target grade dropdown](/guides/change-target-grade/change-grade.png)\n\nYou will notice the task list on the left immediately update to indicate which tasks you now need to complete.\n\nFurther questions on how your unit is graded, please see your unit chair.\n","title":"Changing your target grade","summary":"See how to change your target grade in Doubtfire","authors":["jakerenzella"],"html":"<p>In Doubtfire, your target grade indicates to both you and the teaching staff, how you are looking to approach your unit of study.</p><p>There are four target grades:</p><ul><li><strong>P</strong> - Pass</li><li><strong>C</strong> - Credit</li><li><strong>D</strong> - Distinction</li><li><strong>HD</strong> - High Distinction</li></ul><p>The target grade selected in Doubtfire changes the sequence and number of tasks which need to be completed in order to achieve that grade.</p><p>For example, there may be 20 Pass tasks in a unit which need to be completed to achieve a Pass grade, however to achieve a Credit grade you would need to complete all of the Pass tasks, and the Credit tasks.</p><p>To change your target grade, simply log in to Doubtfire and select the unit for which you'd like to change the target grade.</p><p>From the main overview page, select the <em>target grade</em> dropdown:</p><p><img src=\"/guides/change-target-grade/profile-view.png\" alt=\"Profile view\"></p><p>Then select the target grade:</p><p><img src=\"/guides/change-target-grade/change-grade.png\" alt=\"Target grade dropdown\"></p><p>You will notice the task list on the left immediately update to indicate which tasks you now need to complete.</p><p>Further questions on how your unit is graded, please see your unit chair.</p>","toc":[]},"__N_SSG":true}