{"pageProps":{"id":"installation-virtual-machine","audience":"developer","markdown":"\nIf you are new to the Doubtfire project, there is a pre-packaged virtual machine that contains a fully-functional\ninstance of Doubtfire. This method of installation offers a quick, no fuss way to experiment with Doubtfire; to see what\na functional installation should look like. It allows you to interact with both the back-end API and the web interface,\nto test user functionality for the various user roles, and to familiarize yourself with the codebase. However,\ninstallation through this method is limited:\n\n- To minimize the size of the virtual machine itself, the virtualized instance of Doubtfire does not contain LaTeX,\n  meaning that the platform's PDF functionality will not work.\n\n- The virtual hard disk allocated to the machine has also been limited to the size required for a bare-bones Doubtfire\n  installation.\n\n- VirtualBox's overheads may impair the performance of Doubtfire software; it is recommended you run Doubtfire with an\n  allocated hard drive of 20 GB or more, and with 4 GB or more of RAM.\n\nThis installation method requires you to install the VirtualBox software onto your host machine. VirtualBox is an\nopen-source hypervisor developed by Oracle. It effectively emulates the hardware of a computer, within your existing\ncomputer and operating system--allowing you to run a computer within a computer. Installation instructions are available\nthrough the [VirtualBox website](https://www.virtualbox.org/). Note: it may also be possible to install the packaged\nvirtual machine using another hypervisor by exporting/importing the provided virtual machine. This method has not been\ntested.\n\nOnce VirtualBox has been installed, download the\n[Doubtfire Virtual Machine](https://deakin365-my.sharepoint.com/:u:/g/personal/jwtayl_deakin_edu_au/Ea5v4lk7mqZKi4bs9-sykoIBvtC9YY6JrYtneqIrp899fw?e=xJ0aH).\nImport the Virtual Machine into VirtualBox using the import utility, as depicted below.\n\n![Virtual Machine Import](/guides/installation-virtual-machine/1.png)\n\nOnce the Virtual Machine has been imported, starting the machine should load Ubuntu desktop. Note that **_doubtfire_**\nis both the username _and_ password for this Ubuntu machine.\n\n![Ubuntu Desktop](/guides/installation-virtual-machine/2.png)\n","title":"Install Doubtfire as a Virtual Machine","summary":"Guides the user through installation with a pre-packaged virtual machine","authors":["Justfeedme"],"html":"<p>If you are new to the Doubtfire project, there is a pre-packaged virtual machine that contains a fully-functional instance of Doubtfire. This method of installation offers a quick, no fuss way to experiment with Doubtfire; to see what a functional installation should look like. It allows you to interact with both the back-end API and the web interface, to test user functionality for the various user roles, and to familiarize yourself with the codebase. However, installation through this method is limited:</p><ul><li><p>To minimize the size of the virtual machine itself, the virtualized instance of Doubtfire does not contain LaTeX, meaning that the platform's PDF functionality will not work.</p></li><li><p>The virtual hard disk allocated to the machine has also been limited to the size required for a bare-bones Doubtfire installation.</p></li><li><p>VirtualBox's overheads may impair the performance of Doubtfire software; it is recommended you run Doubtfire with an allocated hard drive of 20 GB or more, and with 4 GB or more of RAM.</p></li></ul><p>This installation method requires you to install the VirtualBox software onto your host machine. VirtualBox is an open-source hypervisor developed by Oracle. It effectively emulates the hardware of a computer, within your existing computer and operating system--allowing you to run a computer within a computer. Installation instructions are available through the <a href=\"https://www.virtualbox.org/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">VirtualBox website</a>. Note: it may also be possible to install the packaged virtual machine using another hypervisor by exporting/importing the provided virtual machine. This method has not been tested.</p><p>Once VirtualBox has been installed, download the <a href=\"https://deakin365-my.sharepoint.com/:u:/g/personal/jwtayl_deakin_edu_au/Ea5v4lk7mqZKi4bs9-sykoIBvtC9YY6JrYtneqIrp899fw?e=xJ0aH\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Doubtfire Virtual Machine</a>. Import the Virtual Machine into VirtualBox using the import utility, as depicted below.</p><p><img src=\"/guides/installation-virtual-machine/1.png\" alt=\"Virtual Machine Import\"></p><p>Once the Virtual Machine has been imported, starting the machine should load Ubuntu desktop. Note that <strong><em>doubtfire</em></strong> is both the username <em>and</em> password for this Ubuntu machine.</p><p><img src=\"/guides/installation-virtual-machine/2.png\" alt=\"Ubuntu Desktop\"></p>","toc":[]},"__N_SSG":true}