{"pageProps":{"id":"create-manage-student-groups","audience":"staff","markdown":"\nTo manage students in a group, first you need to ensure your unit has group sets setup. A group set is a definition of\nthe types of groups you can have in a unit. To setup a group set:\n\n1. Log in to Doubtfire.\n\n1. Select Manage Units from the Administration dropdown:\n\n   ![Manage Units](/guides/create-manage-student-groups/manage-units.png)\n\n1. Select the unit you wish to administer.\n\n1. Select the _group_ tab.\n\n   ![Manage Groups](/guides/create-manage-student-groups/group-set.png)\n\n1. Select _New Group Set_.\n\n   You will now see a new group created in the Group Set list, select the edit button to edit the following options:\n\n   - **Name:** The name of the group set, by default this is \"Group Work\"\n   - **Create Groups:** Who has permissions to create new groups in the group set, staff, or staff and students.\n   - **Manage Groups:** Who has permissions to manage groups in the group set, staff, or staff and students.\n   - **Restrict to Tutorials:** if true, only students from the same tutorial can be in a group.\n\n1. Select _save_ then select the group set in the group sets list to view more information:\n\n   - Create a group of students in the group set, by typing a group name, and selecting _Create Group_:\n\n   ![Create Group](/guides/create-manage-student-groups/new-group.png)\n\n   - Add students to the group by typing the student name:\n\n   ![Adding Students to Group](/guides/create-manage-student-groups/adding-members.png)\n\n   You can also export and import CSV files for batch group allocation. To view the correct format of the CSV file for\n   import, you can export the CSV by selecting _Download CSV_.\n","title":"Create & manage student groups","summary":"See how you can create & manage students in groups in Doubtfire.","authors":["jakerenzella"],"html":"<p>To manage students in a group, first you need to ensure your unit has group sets setup. A group set is a definition of the types of groups you can have in a unit. To setup a group set:</p><ol><li><p>Log in to Doubtfire.</p></li><li><p>Select Manage Units from the Administration dropdown:</p><p><img src=\"/guides/create-manage-student-groups/manage-units.png\" alt=\"Manage Units\"></p></li><li><p>Select the unit you wish to administer.</p></li><li><p>Select the <em>group</em> tab.</p><p><img src=\"/guides/create-manage-student-groups/group-set.png\" alt=\"Manage Groups\"></p></li><li><p>Select <em>New Group Set</em>.</p><p>You will now see a new group created in the Group Set list, select the edit button to edit the following options:</p><ul><li><strong>Name:</strong> The name of the group set, by default this is \"Group Work\"</li><li><strong>Create Groups:</strong> Who has permissions to create new groups in the group set, staff, or staff and students.</li><li><strong>Manage Groups:</strong> Who has permissions to manage groups in the group set, staff, or staff and students.</li><li><strong>Restrict to Tutorials:</strong> if true, only students from the same tutorial can be in a group.</li></ul></li><li><p>Select <em>save</em> then select the group set in the group sets list to view more information:</p><ul><li>Create a group of students in the group set, by typing a group name, and selecting <em>Create Group</em>:</li></ul><p><img src=\"/guides/create-manage-student-groups/new-group.png\" alt=\"Create Group\"></p><ul><li>Add students to the group by typing the student name:</li></ul><p><img src=\"/guides/create-manage-student-groups/adding-members.png\" alt=\"Adding Students to Group\"></p><p>You can also export and import CSV files for batch group allocation. To view the correct format of the CSV file for import, you can export the CSV by selecting <em>Download CSV</em>.</p></li></ol>","toc":[]},"__N_SSG":true}