{"pageProps":{"id":"view-class-information","audience":"staff","markdown":"\n# Student List\n\nThe student list is an important part of Doubtfire, which shows all enrolled students in a unit, information such as\nstudent class allocation, and an overview of a student's progression through a unit.\n\nTo view the student list, log in to Doubtfire and select the unit for which you wish to view the student list from the\ntop-left dropdown:\n\n![Student List](/guides/view-class-information/student-list.png)\n\nYou will see a list of students enrolled in the unit. The list is cut at 15 students per page, with pagination running\nacross the bottom of the page. By clicking anywhere in a list, you will be taken to the student's profile page, which\nshows individual tasks status, their target grade, and burndown chart.\n\nThe student list is broken down into a number of sections:\n\n![Student List](/guides/view-class-information/list.png)\n\n## Search bar and filter\n\nThe search bar allows you to search and filter for:\n\n- **Student Name:** The search for students with matching names.\n\n- **Tutor Name:** The students presented will belong to the tutor searched for.\n\n- **Tutorial Filter:** By selecting the dropdown on the right hand side, you will be able to apply filters such as:\n\n  - All tutorials\n  - My tutorials\n  - Sort By Grade\n  - Sort By Plagiarism\n  - Sort By Portfolio Status\n\n## Basic Information\n\nThe left hand panel lists the Student ID, and Name of each student. You can sort by Student ID or Name, and by default\nthe list is sorted by Name, indicated by the blue triangle next to _name_.\n\n## Stats/Progress\n\nThe progress bar in the _stats_ column shows a quick-view of the student's progress through the tasks in the unit. For\nexample in the screenshot below, student_23 has failed 25% of tasks, not started 25% and completed 50%. You can also\nsort by progress -- an easy way to view students who are not progressing through the unit quickly enough.\n\n![Progress](/guides/view-class-information/progress-chart.png)\n\n## Flags\n\nThe glags column provides one of three icon:\n\n- **Target Grade:** Letter/s indicating the target grade, for example _student_23_ is targeting a credit _C_ grade.\n- **Portfolio Generated:** if the Book icon is present, then the student has generated a portfolio in the unit.\n- **Eye icon:** If Doubtfire has detected possible similarities between student work, then an eye icon will be present.\n\n## Tutorials\n\nThe tutorial dropdown column shows which tutorial the student is currently enrolled in. This can be easily changed by\nclicking the dropdown and changing the tutorial.\n\n## Action Buttons\n\nOn the bottom-right hand side of the page, there are two buttons: _Export CSV_ and _enrol Student_.\n\n- **Export CSV:** Exports a CSV of the information presented including name, student ID, progress, flags and tutorial\n  allocation.\n- **Enrol Student:** Manually enrolls a student into the unit.\n\n# Task List\n\nThe task list simply lists each of the tasks in a unit. After logging into Doubtfire, and selecting a unit, from the\ntop-left menu, select _task list_:\n\n![Task List Select](/guides/view-class-information/task-list.png)\n\nIt is broken down into three panels shown below:\n\n![Task List](/guides/view-class-information/task-list2.png)\n\n- **Task List**: The first panel, located on the left hand side, is the list of tasks in the unit. Selecting a task will\n  automatically update the shown task PDF and task details.\n\n- **Task PDF**: The center panel displays the task sheet PDF which will be presented to students.\n\n- **Task Details**: The task details, located on the right panel, show the intended learning outcomes for the selected\n  task, the description, and key information such as the task level, target date, and due date (if applicable).\n\n**Note:** Task information can not be changed from the task list, it can be changed from the _Unit Administration_ ->\n_Task_ tab.\n","title":"Viewing Class Information","summary":"See how to view and interpret student and task lists","authors":["jakerenzella"],"html":"<h2 id=\"student-list\">Student List<a href=\"#student-list\" aria-hidden=\"true\" tabindex=\"-1\"><span> §</span></a></h2><p>The student list is an important part of Doubtfire, which shows all enrolled students in a unit, information such as student class allocation, and an overview of a student's progression through a unit.</p><p>To view the student list, log in to Doubtfire and select the unit for which you wish to view the student list from the top-left dropdown:</p><p><img src=\"/guides/view-class-information/student-list.png\" alt=\"Student List\"></p><p>You will see a list of students enrolled in the unit. The list is cut at 15 students per page, with pagination running across the bottom of the page. By clicking anywhere in a list, you will be taken to the student's profile page, which shows individual tasks status, their target grade, and burndown chart.</p><p>The student list is broken down into a number of sections:</p><p><img src=\"/guides/view-class-information/list.png\" alt=\"Student List\"></p><h3 id=\"search-bar-and-filter\">Search bar and filter<a href=\"#search-bar-and-filter\" aria-hidden=\"true\" tabindex=\"-1\"><span> §</span></a></h3><p>The search bar allows you to search and filter for:</p><ul><li><p><strong>Student Name:</strong> The search for students with matching names.</p></li><li><p><strong>Tutor Name:</strong> The students presented will belong to the tutor searched for.</p></li><li><p><strong>Tutorial Filter:</strong> By selecting the dropdown on the right hand side, you will be able to apply filters such as:</p><ul><li>All tutorials</li><li>My tutorials</li><li>Sort By Grade</li><li>Sort By Plagiarism</li><li>Sort By Portfolio Status</li></ul></li></ul><h3 id=\"basic-information\">Basic Information<a href=\"#basic-information\" aria-hidden=\"true\" tabindex=\"-1\"><span> §</span></a></h3><p>The left hand panel lists the Student ID, and Name of each student. You can sort by Student ID or Name, and by default the list is sorted by Name, indicated by the blue triangle next to <em>name</em>.</p><h3 id=\"statsprogress\">Stats/Progress<a href=\"#statsprogress\" aria-hidden=\"true\" tabindex=\"-1\"><span> §</span></a></h3><p>The progress bar in the <em>stats</em> column shows a quick-view of the student's progress through the tasks in the unit. For example in the screenshot below, student_23 has failed 25% of tasks, not started 25% and completed 50%. You can also sort by progress -- an easy way to view students who are not progressing through the unit quickly enough.</p><p><img src=\"/guides/view-class-information/progress-chart.png\" alt=\"Progress\"></p><h3 id=\"flags\">Flags<a href=\"#flags\" aria-hidden=\"true\" tabindex=\"-1\"><span> §</span></a></h3><p>The glags column provides one of three icon:</p><ul><li><strong>Target Grade:</strong> Letter/s indicating the target grade, for example <em>student_23</em> is targeting a credit <em>C</em> grade.</li><li><strong>Portfolio Generated:</strong> if the Book icon is present, then the student has generated a portfolio in the unit.</li><li><strong>Eye icon:</strong> If Doubtfire has detected possible similarities between student work, then an eye icon will be present.</li></ul><h3 id=\"tutorials\">Tutorials<a href=\"#tutorials\" aria-hidden=\"true\" tabindex=\"-1\"><span> §</span></a></h3><p>The tutorial dropdown column shows which tutorial the student is currently enrolled in. This can be easily changed by clicking the dropdown and changing the tutorial.</p><h3 id=\"action-buttons\">Action Buttons<a href=\"#action-buttons\" aria-hidden=\"true\" tabindex=\"-1\"><span> §</span></a></h3><p>On the bottom-right hand side of the page, there are two buttons: <em>Export CSV</em> and <em>enrol Student</em>.</p><ul><li><strong>Export CSV:</strong> Exports a CSV of the information presented including name, student ID, progress, flags and tutorial allocation.</li><li><strong>Enrol Student:</strong> Manually enrolls a student into the unit.</li></ul><h2 id=\"task-list\">Task List<a href=\"#task-list\" aria-hidden=\"true\" tabindex=\"-1\"><span> §</span></a></h2><p>The task list simply lists each of the tasks in a unit. After logging into Doubtfire, and selecting a unit, from the top-left menu, select <em>task list</em>:</p><p><img src=\"/guides/view-class-information/task-list.png\" alt=\"Task List Select\"></p><p>It is broken down into three panels shown below:</p><p><img src=\"/guides/view-class-information/task-list2.png\" alt=\"Task List\"></p><ul><li><p><strong>Task List</strong>: The first panel, located on the left hand side, is the list of tasks in the unit. Selecting a task will automatically update the shown task PDF and task details.</p></li><li><p><strong>Task PDF</strong>: The center panel displays the task sheet PDF which will be presented to students.</p></li><li><p><strong>Task Details</strong>: The task details, located on the right panel, show the intended learning outcomes for the selected task, the description, and key information such as the task level, target date, and due date (if applicable).</p></li></ul><p><strong>Note:</strong> Task information can not be changed from the task list, it can be changed from the <em>Unit Administration</em> -> <em>Task</em> tab.</p>","toc":[{"id":"student-list","text":"Student List","depth":1},{"id":"search-bar-and-filter","text":"Search bar and filter","depth":2},{"id":"basic-information","text":"Basic Information","depth":2},{"id":"statsprogress","text":"Stats/Progress","depth":2},{"id":"flags","text":"Flags","depth":2},{"id":"tutorials","text":"Tutorials","depth":2},{"id":"action-buttons","text":"Action Buttons","depth":2},{"id":"task-list","text":"Task List","depth":1}]},"__N_SSG":true}